lkolbly/cmsis-svd/data/TexasInstruments/LM3S5K36.svd
        <register>
          <name>RCC2</name>
          <description>Run-Mode Clock Configuration 2</description>
          <addressOffset>0x00000070</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCC2_OSCSRC2</name>
              <description>Oscillator Source 2</description>
              <bitRange>[6:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_OSCSRC2_MO</name>
                  <description>MOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_OSCSRC2_IO</name>
                  <description>PIOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_OSCSRC2_IO4</name>
                  <description>PIOSC/4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_OSCSRC2_30</name>
                  <description>30 kHz</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_OSCSRC2_419</name>
                  <description>4.194304 MHz</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_OSCSRC2_32</name>
                  <description>32.768 kHz</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RCC2_BYPASS2</name>
              <description>PLL Bypass 2</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC2_PWRDN2</name>
              <description>Power-Down PLL 2</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC2_USBPWRDN</name>
              <description>Power-Down USB PLL</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC2_SYSDIV2LSB</name>
              <description>Additional LSB for SYSDIV2</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC2_SYSDIV2</name>
              <description>System Clock Divisor 2</description>
              <bitRange>[28:23]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_2</name>
                  <description>System clock /2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_3</name>
                  <description>System clock /3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_4</name>
                  <description>System clock /4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_5</name>
                  <description>System clock /5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_6</name>
                  <description>System clock /6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_7</name>
                  <description>System clock /7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_8</name>
                  <description>System clock /8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_9</name>
                  <description>System clock /9</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_10</name>
                  <description>System clock /10</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_11</name>
                  <description>System clock /11</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_12</name>
                  <description>System clock /12</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_13</name>
                  <description>System clock /13</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_14</name>
                  <description>System clock /14</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_15</name>
                  <description>System clock /15</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_16</name>
                  <description>System clock /16</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_17</name>
                  <description>System clock /17</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_18</name>
                  <description>System clock /18</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_19</name>
                  <description>System clock /19</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_20</name>
                  <description>System clock /20</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_21</name>
                  <description>System clock /21</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_22</name>
                  <description>System clock /22</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_23</name>
                  <description>System clock /23</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_24</name>
                  <description>System clock /24</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_25</name>
                  <description>System clock /25</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_26</name>
                  <description>System clock /26</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_27</name>
                  <description>System clock /27</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_28</name>
                  <description>System clock /28</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_29</name>
                  <description>System clock /29</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_30</name>
                  <description>System clock /30</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_31</name>
                  <description>System clock /31</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_32</name>
                  <description>System clock /32</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_33</name>
                  <description>System clock /33</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_34</name>
                  <description>System clock /34</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_35</name>
                  <description>System clock /35</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_36</name>
                  <description>System clock /36</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_37</name>
                  <description>System clock /37</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_38</name>
                  <description>System clock /38</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_39</name>
                  <description>System clock /39</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_40</name>
                  <description>System clock /40</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_41</name>
                  <description>System clock /41</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_42</name>
                  <description>System clock /42</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_43</name>
                  <description>System clock /43</description>
                  <value>0x2a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_44</name>
                  <description>System clock /44</description>
                  <value>0x2b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_45</name>
                  <description>System clock /45</description>
                  <value>0x2c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_46</name>
                  <description>System clock /46</description>
                  <value>0x2d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_47</name>
                  <description>System clock /47</description>
                  <value>0x2e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_48</name>
                  <description>System clock /48</description>
                  <value>0x2f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_49</name>
                  <description>System clock /49</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_50</name>
                  <description>System clock /50</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_51</name>
                  <description>System clock /51</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_52</name>
                  <description>System clock /52</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_53</name>
                  <description>System clock /53</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_54</name>
                  <description>System clock /54</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_55</name>
                  <description>System clock /55</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_56</name>
                  <description>System clock /56</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_57</name>
                  <description>System clock /57</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_58</name>
                  <description>System clock /58</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_59</name>
                  <description>System clock /59</description>
                  <value>0x3a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_60</name>
                  <description>System clock /60</description>
                  <value>0x3b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_61</name>
                  <description>System clock /61</description>
                  <value>0x3c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_62</name>
                  <description>System clock /62</description>
                  <value>0x3d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_63</name>
                  <description>System clock /63</description>
                  <value>0x3e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCC2_SYSDIV2_64</name>
                  <description>System clock /64</description>
                  <value>0x3f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RCC2_DIV400</name>
              <description>Divide PLL as 400 MHz vs. 200 MHz</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCC2_USERCC2</name>
              <description>Use RCC2</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MOSCCTL</name>
          <description>Main Oscillator Control</description>
          <addressOffset>0x0000007C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_MOSCCTL_CVAL</name>
              <description>Clock Validation for MOSC</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGC0</name>
          <description>Run Mode Clock Gating Control Register 0</description>
          <addressOffset>0x00000100</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGC0_WDT0</name>
              <description>WDT0 Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC0_HIB</name>
              <description>HIB Clock Gating Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC0_ADC0SPD</name>
              <description>ADC0 Sample Speed</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RCGC0_ADC0SPD_125K</name>
                  <description>125K samples/second</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCGC0_ADC0SPD_250K</name>
                  <description>250K samples/second</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCGC0_ADC0SPD_500K</name>
                  <description>500K samples/second</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCGC0_ADC0SPD_1M</name>
                  <description>1M samples/second</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RCGC0_ADC1SPD</name>
              <description>ADC1 Sample Speed</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RCGC0_ADC1SPD_125K</name>
                  <description>125K samples/second</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCGC0_ADC1SPD_250K</name>
                  <description>250K samples/second</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCGC0_ADC1SPD_500K</name>
                  <description>500K samples/second</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RCGC0_ADC1SPD_1M</name>
                  <description>1M samples/second</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RCGC0_ADC0</name>
              <description>ADC0 Clock Gating Control</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC0_ADC1</name>
              <description>ADC1 Clock Gating Control</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC0_CAN0</name>
              <description>CAN0 Clock Gating Control</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGC0_WDT1</name>
              <description>WDT1 Clock Gating Control</description>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
