lkolbly/cmsis-svd/data/TexasInstruments/LM3S5K36.svd
        <register>
          <name>DSLPCLKCFG</name>
          <description>Deep Sleep Clock Configuration</description>
          <addressOffset>0x00000144</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DSLPCLKCFG_O</name>
              <description>Clock Source</description>
              <bitRange>[6:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_O_IGN</name>
                  <description>MOSC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_O_IO</name>
                  <description>PIOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_O_30</name>
                  <description>30 kHz</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_O_32</name>
                  <description>32.768 kHz</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DSLPCLKCFG_D</name>
              <description>Divider Field Override</description>
              <bitRange>[28:23]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_1</name>
                  <description>System clock /1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_2</name>
                  <description>System clock /2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_3</name>
                  <description>System clock /3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_4</name>
                  <description>System clock /4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_5</name>
                  <description>System clock /5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_6</name>
                  <description>System clock /6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_7</name>
                  <description>System clock /7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_8</name>
                  <description>System clock /8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_9</name>
                  <description>System clock /9</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_10</name>
                  <description>System clock /10</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_11</name>
                  <description>System clock /11</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_12</name>
                  <description>System clock /12</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_13</name>
                  <description>System clock /13</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_14</name>
                  <description>System clock /14</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_15</name>
                  <description>System clock /15</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_16</name>
                  <description>System clock /16</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_17</name>
                  <description>System clock /17</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_18</name>
                  <description>System clock /18</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_19</name>
                  <description>System clock /19</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_20</name>
                  <description>System clock /20</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_21</name>
                  <description>System clock /21</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_22</name>
                  <description>System clock /22</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_23</name>
                  <description>System clock /23</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_24</name>
                  <description>System clock /24</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_25</name>
                  <description>System clock /25</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_26</name>
                  <description>System clock /26</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_27</name>
                  <description>System clock /27</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_28</name>
                  <description>System clock /28</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_29</name>
                  <description>System clock /29</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_30</name>
                  <description>System clock /30</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_31</name>
                  <description>System clock /31</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_32</name>
                  <description>System clock /32</description>
                  <value>0x1f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_33</name>
                  <description>System clock /33</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_34</name>
                  <description>System clock /34</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_35</name>
                  <description>System clock /35</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_36</name>
                  <description>System clock /36</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_37</name>
                  <description>System clock /37</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_38</name>
                  <description>System clock /38</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_39</name>
                  <description>System clock /39</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_40</name>
                  <description>System clock /40</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_41</name>
                  <description>System clock /41</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_42</name>
                  <description>System clock /42</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_43</name>
                  <description>System clock /43</description>
                  <value>0x2a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_44</name>
                  <description>System clock /44</description>
                  <value>0x2b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_45</name>
                  <description>System clock /45</description>
                  <value>0x2c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_46</name>
                  <description>System clock /46</description>
                  <value>0x2d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_47</name>
                  <description>System clock /47</description>
                  <value>0x2e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_48</name>
                  <description>System clock /48</description>
                  <value>0x2f</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_49</name>
                  <description>System clock /49</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_50</name>
                  <description>System clock /50</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_51</name>
                  <description>System clock /51</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_52</name>
                  <description>System clock /52</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_53</name>
                  <description>System clock /53</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_54</name>
                  <description>System clock /54</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_55</name>
                  <description>System clock /55</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_56</name>
                  <description>System clock /56</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_57</name>
                  <description>System clock /57</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_58</name>
                  <description>System clock /58</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_59</name>
                  <description>System clock /59</description>
                  <value>0x3a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_60</name>
                  <description>System clock /60</description>
                  <value>0x3b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_61</name>
                  <description>System clock /61</description>
                  <value>0x3c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_62</name>
                  <description>System clock /62</description>
                  <value>0x3d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_63</name>
                  <description>System clock /63</description>
                  <value>0x3e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DSLPCLKCFG_D_64</name>
                  <description>System clock /64</description>
                  <value>0x3f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PIOSCCAL</name>
          <description>Precision Internal Oscillator Calibration</description>
          <addressOffset>0x00000150</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PIOSCCAL_UT</name>
              <description>User Trim Value</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PIOSCCAL_UPDATE</name>
              <description>Update Trim</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PIOSCCAL_CAL</name>
              <description>Start Calibration</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PIOSCCAL_UTEN</name>
              <description>Use User Trim Value</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PIOSCSTAT</name>
          <description>Precision Internal Oscillator Statistics</description>
          <addressOffset>0x00000154</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PIOSCSTAT_CT</name>
              <description>Calibration Trim Value</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PIOSCSTAT_CR</name>
              <description>Calibration Result</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_PIOSCSTAT_CRNONE</name>
                  <description>Calibration has not been attempted</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PIOSCSTAT_CRPASS</name>
                  <description>The last calibration operation completed to meet 1% accuracy</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PIOSCSTAT_CRFAIL</name>
                  <description>The last calibration operation failed to meet 1% accuracy</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_PIOSCSTAT_DT</name>
              <description>Default Trim Value</description>
              <bitRange>[22:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DC9</name>
          <description>Device Capabilities 9 ADC Digital Comparators</description>
          <addressOffset>0x00000190</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DC9_ADC0DC0</name>
              <description>ADC0 DC0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC1</name>
              <description>ADC0 DC1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC2</name>
              <description>ADC0 DC2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC3</name>
              <description>ADC0 DC3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC4</name>
              <description>ADC0 DC4 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC5</name>
              <description>ADC0 DC5 Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC6</name>
              <description>ADC0 DC6 Present</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC0DC7</name>
              <description>ADC0 DC7 Present</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC0</name>
              <description>ADC1 DC0 Present</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC1</name>
              <description>ADC1 DC1 Present</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC2</name>
              <description>ADC1 DC2 Present</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC3</name>
              <description>ADC1 DC3 Present</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC4</name>
              <description>ADC1 DC4 Present</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC5</name>
              <description>ADC1 DC5 Present</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC6</name>
              <description>ADC1 DC6 Present</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DC9_ADC1DC7</name>
              <description>ADC1 DC7 Present</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMSTAT</name>
          <description>Non-Volatile Memory Information</description>
          <addressOffset>0x000001A0</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_NVMSTAT_FWB</name>
              <description>32 Word Flash Write Buffer Active</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
